app/controllers/queries_controller.rb

SELECT * FROM "queries"
---
  def index
    @queries = Query.all

SELECT * FROM "queries" WHERE ("queries"."id" = 1)
---
  def show
    @query = Query.find(params[:id])

INSERT INTO "queries" ("created_at", "updated_at", "terms") VALUES('2010-08-27 01:53:54', '2010-08-27 01:53:54', 'kansas news company')
---
  def create
    # @query = Query.new(params[:query])
    @query = Query.search(params[:query])
    if @query.save

SELECT * FROM "queries" WHERE ("queries"."id" = 1)
DELETE FROM "queries" WHERE "id" = 1
---
  def destroy
    @query = Query.find(params[:id])
    @query.destroy